* Ruby Quipu

A Ruby investigation and implementation of the following paper:

https://ccsenet.org/journal/index.php/cis/article/view/0/52950

We'll start by implementing my understanding of quipu as an organized system of
integer data. The paper keeps saying "heirarchical, partially unsorted, grouped
and summed". Each cord encodes a number in base 10, with each knot being a digit.
Naively, we could implement this as an array of integers from 0-9. In the most
basic interpretation, we read the knots as an integer.

#+begin_src ruby
  cord = Class.new do
    attr_reader :knots

    def initialize
      @knots = []
    end

    def <<(val) = @knots << val
    def to_s = @knots.join
    def to_i = to_s.to_i
  end

  a_cord = cord.new
  a_cord << 1
  a_cord << 2
  a_cord << 3

  [a_cord.knots, a_cord.to_i]
#+end_src

#+RESULTS:
| (1 2 3) | 123 |

Adding a knot for 1 in the hundreds place, 2 in the tens, and 3 in the units
we get the integer 123.

